Repository: neo-project/neo
Catalog: src/Neo.GUI/Properties/Strings.*.resx
Languages: es_es, zh_hans

source: About
es_es: Acerca de
zh_hans: 关于

# AboutVersion
source: Version:
es_es: Versión:
zh_hans: 版本：

# AddContractFailedMessage
source: Failed to add smart contract, corresponding private key missing in this wallet.
es_es: Fallo al añadir el contrato inteligente. Falta la correspondiente clave privada en el monedero.
zh_hans: 无法添加智能合约，因为当前钱包中不包含签署该合约的私钥。

source: Address
es_es: Dirección
zh_hans: 地址

source: Cancel
zh_hans: 取消

source: Change password successful.
es_es: Contraseña cambiada con éxito.
zh_hans: 修改密码成功。

source: Confirm
zh_hans: 确认

# CostTips
source: will be consumed, confirm?
zh_hans: 费用即将被消耗，确认？

# CostTitle
source: Cost Warning
zh_hans: 消费提示

# DeleteAddressConfirmationCaption
source: Confirmation
es_es: Confirmación
zh_hans: 删除地址确认

# DeleteAddressConfirmationMessage
source: Upon deletion, assets in these addresses will be permanently lost, are you sure to proceed?
es_es: Una vez eliminados, los activos de estas direcciones se perderán permanentemente. ¿Deseas continuar?
zh_hans: 删除地址后，这些地址中的资产将永久性地丢失，确认要继续吗？

# DeleteAssetConfirmationMessage
source: Assets cannot be recovered once deleted, are you sure to delete the assets?
es_es: Los activos no se pueden recuperar una vez eliminados. ¿Deseas eliminarlos?
zh_hans: 资产删除后将无法恢复，您确定要删除以下资产吗？

# DeleteConfirmation
source: Confirmation
es_es: Confirmación
zh_hans: 删除确认

# EnterRemarkMessage
source: Enter remark here, which will be recorded on the blockchain
es_es: Notas de la transacción que se grabará en la blockchain.
zh_hans: 请输入备注信息，该信息将被记录在区块链上

# EnterRemarkTitle
source: Transaction Remark
es_es: Notas de la transacción
zh_hans: 交易备注

# ExecutionFailed
source: Execution terminated in fault state.
es_es: La ejecución terminó con un estado de error.
zh_hans: 合约执行遇到错误并退出。

# ExpiredCertificate
source: Expired
es_es: Caducado
zh_hans: 证书已过期

source: Failed
es_es: Falló
zh_hans: 失败

# HighPriority
source: High Priority Transaction
zh_hans: 优先交易

source: Import Watch-Only Address
es_es: Importar dirección sólo lectura
zh_hans: 导入监视地址

# IncompletedSignatureMessage
source: Transaction initiated, but the signature is incomplete.
es_es: Transacción iniciada aunque la firma está incompleta.
zh_hans: 交易构造完成，但没有足够的签名：

# IncompletedSignatureTitle
source: Incomplete signature
es_es: Firma incompleta
zh_hans: 签名不完整

# InstallCertificateCancel
source: You have cancelled the certificate installation.
es_es: Instalación del certificado cancelada.
zh_hans: 您已取消了证书安装过程。

# InstallCertificateCaption
source: Install the certificate
es_es: Instalar certificado
zh_hans: 安装证书

# InstallCertificateText
source: NEO must install Onchain root certificate to validate assets on the blockchain, install it now?
es_es: NEO debe instalar el certificado raíz de Onchain para validar activos en la blockchain. ¿Instalar ahora?
zh_hans: NEO需要安装Onchain的根证书才能对区块链上的资产进行认证，是否现在就安装证书？

# InsufficientFunds
source: Insufficient funds, transaction cannot be initiated.
es_es: Fondos insuficientes, la transacción no se puede iniciar.
zh_hans: 余额不足，无法创建交易。

# InvalidCertificate
source: Invalid
es_es: Inválido
zh_hans: 证书错误

# MigrateWalletCaption
source: Migrate Wallet
es_es: Migrar monedero
zh_hans: 钱包文件升级

# MigrateWalletMessage
source: Opening wallet files in older versions, update to newest format? Note: updated files cannot be openned by clients in older versions!
es_es: Abriendo ficheros de monederos antiguos, actualizar al nuevo formato? Aviso: los ficheros actualizados no podran ser abiertos por clientes de versiones antiguas.
zh_hans: 正在打开旧版本的钱包文件，是否尝试将文件升级为新版格式？ 注意，升级后将无法用旧版本的客户端打开该文件！

# MigrateWalletSucceedMessage
source: Wallet file relocated. New wallet file has been saved at:
zh_hans: 钱包文件迁移成功，新的钱包文件已经自动保存到以下位置：

source: Password Incorrect
es_es: Contraseña incorrecta
zh_hans: 密码错误！

# RelaySuccessText
source: Data broadcast success, the hash is shown as follows:
es_es: Datos emitidos con éxito. El hash se muestra como sigue:
zh_hans: 数据广播成功，这是广播数据的散列值：

# RelaySuccessTitle
source: Broadcast Success
es_es: Emisión realizada con éxito
zh_hans: 广播成功

# RelayTitle
source: Raw:
zh_hans: 原始数据：

# SendTxSucceedMessage
source: Transaction sent, TXID:
es_es: Transacción enviada, TXID:
zh_hans: 交易已发送，这是交易编号(TXID)：

# SendTxSucceedTitle
source: Transaction successful
es_es: Transacción realizada con éxito
zh_hans: 交易成功

# SigningFailedKeyNotFoundMessage
source: The private key that can sign the data is not found.
es_es: Falta la clave privada para firmar los datos.
zh_hans: 没有找到可以签署该数据的私钥。

# SigningFailedNoDataMessage
source: You must input JSON object pending signature data.
es_es: Debes introducir el objeto JSON de los datos pendientes de firmar.
zh_hans: 必须输入一段含有待签名数据的JSON对象。

# SystemIssuer
source: System
zh_hans: NEO系统

# TradeFailedFakeDataMessage
source: Validation failed, the counterparty falsified the transaction content!
es_es: ¡Falló la validación! El contratante falsificó el contenido de la transacción.
zh_hans: 验证失败，对方篡改了交易内容！

# TradeFailedInvalidDataMessage
source: Validation failed, the counterparty generated illegal transaction content!
es_es: ¡Falló la validación! El contratante generó una transacción con contenido ilegal.
zh_hans: 验证失败，对方构造了非法的交易内容！

# TradeFailedNoSyncMessage
source: Validation failed, invalid transaction or unsynchronized blockchain, please try again when synchronized!
es_es: ¡Falló la validación! Transacción no válida o blockchain sin sincronizar. Inténtalo de nuevo después de sincronizar.
zh_hans: 验证失败，交易无效或者区块链未同步完成，请同步后再试！

# TradeNeedSignatureCaption
source: Need Signature
es_es: Firma necesaria.
zh_hans: 签名不完整

# TradeNeedSignatureMessage
source: Transaction generated, please send the following information to the counterparty for signing:
es_es: Transacción generada. Por favor, envia la siguiente información al contratante para su firma:
zh_hans: 交易构造完成，请将以下信息发送给对方进行签名：

# TradeRequestCreatedCaption
source: Trade Request
es_es: Solicitud de transacción.
zh_hans: 交易请求

# TradeRequestCreatedMessage
source: Transaction request generated, please send it to the counterparty or merge it with the counterparty's request.
es_es: Solicitud de transacción generada. Por favor, enviala al contratante o incorporala a la solicitud del contratante.
zh_hans: 交易请求已生成，请发送给对方，或与对方的请求合并：

# TradeSuccessCaption
source: Trade Success
es_es: Transacción realizada con éxito.
zh_hans: 交易成功

# TradeSuccessMessage
source: Transaction sent, this is the TXID:
es_es: Transacción enviada, este es el TXID:
zh_hans: 交易已发送，这是交易编号(TXID)：

source: unconfirmed
es_es: Sin confirmar.
zh_hans: 未确认

source: unknown issuer
es_es: Emisor desconocido.
zh_hans: 未知发行者

# UnsynchronizedBlock
source: Blockchain unsynchronized, transaction cannot be sent.
es_es: Blockchain sin sincronizar, la transacción no puede ser enviada.
zh_hans: 区块链未同步完成，无法发送该交易。
